

INSERT INTO Product(Name, Unit, Description, Category) 
VALUES ('Hyundai Creta'       , 'ед.', 'Мощность: 150 Расход на 100 км: 5.8-9.2 л'              , 'Джип'),
	   ('Skoda Karoq'	      , 'ед.', 'Максимальная скорость 185 Время разгона до 100 км/ч 11' , 'Джип'),
	   ('Volvo XC90'	      , 'ед.', 'Мощность 225 Расход топлива 5,8'						, 'Джип'),
	   ('Nissan Sentra'	      , 'ед.', 'Мощность:	117 л.с Разгон до 100 10.6'					, 'Седан'),
	   ('Kia Opirus'          , 'ед.', 'Объем двигателя	3.0 Тип КПП	автоматическая'				, 'Седан'),
	   ('Honda Shuttle'		  , 'ед.', 'мотор объемом 2.2'										, 'Минивэн'),
	   ('Subaru Exiga'	      , 'ед.', 'Размерность шин — Bridgestone 205/60 R 16'				, 'Минивэн'),
	   ('Suzuki Landy'		  , 'ед.', 'Объем 2.0 л Трансмиссия Вариатор Привод Передний'		, 'Минивэн'),
	   ('Audi Q3'		      , 'ед.', 'Внедорожник, 5 дверей, 5 мест 2018 – н.в., II поколение', 'Купе'),
	   ('Audi A1'			  , 'ед.', 'Макс. мощность при об/мин:	86 л. с./4800'				, 'Купе');

SELECT * FROM Product;