

INSERT INTO Client  (Name, Phone, Address, Sex)
VALUES 
('Захарова Александра Львовна',		'785654363619',   'Ki. Gedebage Selatan No. 997, Tebing Tinggi 32130, BaBel', 'Ж'),
('Зубков Георгий Кириллович',		'30923438603',	  'Ki. Kyai Gede No. 916, Tual 20240, NTB',					  'М'),
('Виноградова Мария Фёдоровна',		'96652318591101', 'Gg. Bah Jaya No. 955, Pematangsiantar 97750, SulTra',	  'Ж'),
('Григорьев Фёдор Даниилович',		'555789679899',	  'Dk. Asia Afrika No. 973, Medan 64836, JaTeng',			  'М'),
('Орлова Агата Александровна',		'47075413022',	  'Jln. Peta No. 971, Bogor 25100, KalUt',				      'Ж');


INSERT INTO Employee(Name, ID_Manager) 
VALUES
('Федорова Екатерина Львовна', null),
('Владимирова Надежда Георгиевна', null),
('Ларионова Вероника Максимовна', null),
('Жуков Богдан Никитич', null),
('Андреев Мирон Гордеевич', null),
('Попова Виктория Игоревна', null),
('Максимова София Павловна', null);

UPDATE Employee SET ID_Manager = 1 WHERE ID in (2, 3);
UPDATE Employee SET ID_Manager = 2 WHERE ID in (4, 5);
UPDATE Employee SET ID_Manager = 3 WHERE ID in (6, 7);

INSERT INTO Product(Name, Unit, Description, Category) 
VALUES ('Hyundai Creta'       , 'ед.', 'Мощность: 150 Расход на 100 км: 5.8-9.2 л'              , 'Джип'),
	   ('Skoda Karoq'	      , 'ед.', 'Максимальная скорость 185 Время разгона до 100 км/ч 11' , 'Джип'),
	   ('Volvo XC90'	      , 'ед.', 'Мощность 225 Расход топлива 5,8'						, 'Джип'),
	   ('Nissan Sentra'	      , 'ед.', 'Мощность:	117 л.с Разгон до 100 10.6'					, 'Седан'),
	   ('Kia Opirus'          , 'ед.', 'Объем двигателя	3.0 Тип КПП	автоматическая'				, 'Седан'),
	   ('Honda Shuttle'		  , 'ед.', 'мотор объемом 2.2'										, 'Минивэн'),
	   ('Subaru Exiga'	      , 'ед.', 'Размерность шин — Bridgestone 205/60 R 16'				, 'Минивэн'),
	   ('Suzuki Landy'		  , 'ед.', 'Объем 2.0 л Трансмиссия Вариатор Привод Передний'		, 'Минивэн'),
	   ('Audi Q3'		      , 'ед.', 'Внедорожник, 5 дверей, 5 мест 2018 – н.в., II поколение', 'Купе'),
	   ('Audi A1'			  , 'ед.', 'Макс. мощность при об/мин:	86 л. с./4800'				, 'Купе');

INSERT INTO Provider(Name) VALUES
('Давыдов Владимир Андреевич'),
('Коновалов Руслан Миронович'),
('Тимофеев Георгий Михайлович'),
('Громов Юрий Андреевич'),
('Панин Мирон Сергеевич');

INSERT INTO Store (ID_Provider,	ID_Product,	Quantity,	Price,	Datee) VALUES 
(1,	2,	0,	200000,	'23.12.2014'),
(1,	8,	0,	200000,	'25.04.2024'),
(2,	4,	10,	210000,	'22.08.2020'),
(2,	4,	5,	2100000, '15.09.2030'),
(4,	10,	14,	410000,	'27.06.2031'),
(5,	10,	8,	401998,	'12.04.2008'),
(1,	6,	13,	803909,	'06.07.2020'),
(4,	5,	25,	542360,	'20.06.2030'),
(2,	7,	3,	604350,	'02.03.2026'),
(2,	9,	80,	831390,	'28.10.2016');

INSERT INTO Deal (Datee,	ID_Store,	ID_Client,	ID_Employee,	Quantity,	Discount) VALUES
('23.01.2027',	4,	1,	4,	3,	5.00),
('02.02.2029',	5,	2,	5,	4,	0.00),
('15.03.2018',	6,	3,	6,	2,	15.00),
('24.06.2015',	7,	4,	7,	12,	10.00),
('13.11.2011',	8,	5,	4,	1,	3.00);